# x = 190
# p = 2
# print(x * p)

# a = 10000
# b = 11000
# c = 10500
# print












# a = input("Сколько денег на счету? - ")
# # a = int(a.replace("",""))
#
# curs = 36000
#
# if a >= curs:
#     a -= curs
#     print("Курс успешно приобретён.")
#     print("Хорошего дня!")
# else:
#     print("Кете!")






# a = input("Введите сумму которые хотите снять: - ")
# a = int(a.replace("",""))
#
# balance = 500, 1000, 2000, 5000
#
# if a in balance:
#     a -= balance
#     print("Возмите чек!")
# else:
#     print("Такую сумму снять невазможно. Обратитесь в другой банкомат!")






# a = int(input("Введите сумму которые хотите снять: - "))
#
# if a % 500 == 0:
#     print("Возьмите чек.")
# elif a % 1000 == 0:
#     print("Возьмите чек.")
# elif a % 2000 == 0:
#     print("Возьмите чек.")
# elif a % 5000 == 0:
#     print("Возьмите чек.")
# else:
#     print("Такую сумму снять невазможно. Обратитесь в другой банкомат.")














# i = int(input("Введите кол-во баллов по русскому языку: "))
# a = int(input("Введите кол-во баллов по математике: "))
# j = int(input("Введите кол-во баллов по информатике: "))
#
# if i >= 90 and a >= 90 and j >= 90:
#     print("Поздравляю, ты поступил на бюджет")
# else:
#     print("К сожалению, ты не поступил на бюджет"





