# Посчитать количество уникальных элементов в списке:
# numbers = [1, 2, 3, 2, 4, 5, 3]

# num = [1, 2, 3, 2, 4, 5, 3]
# nums = set(num)
# nam = len(nums)
# print(nam)



# Удалить дубликаты из списка с помощью множества:
# numbers = [1, 2, 3, 2, 4, 5, 3]

# num = [1, 2, 3, 2, 4, 5, 3]
# nam = list(set(num))
# print(nam)




# Найти объединение двух множеств:
# a = {1, 2, 3}
# b = {2, 3, 4}

# a = {1, 2, 3}
# b = {2, 3, 4}
# c = a | b
# print(c)





# Найти пересечение двух множеств:
# a = {1, 2, 3}
# b = {2, 3, 4}



