# print("Hello World")
# a = 'Hello World'
# print(len(a))
# import random
#
# a = '[-1, 2, -3, 4, -5]'
# # print(max(a))
# print(a.index('2'))

import random
# student = {
#     'Ivan': 90,
#     'Loola': 85,
#     'Aigerim': 87,
#     'Murat': 93,
#     'Aibek': 89,
#     'Maks': 86,
# }
# c = random.randint(80, 99)
# print(c)
# print(student.values())
# # print(student.keys())
# az = []
# kop = []
# for k, v in student.items():
#     if v >= 90:
#         kop.append(k)
#     else:
#         az.append(k)
# print(az)
# print(kop)
# # print(f'{az}, {student}')




# 1. Создайте словарь, содержащий информацию о вашем любимом фильме: название,
# год выпуска, режиссер и главных актеров.



# a = {
#   "название": "Человек-Паук",
#   "год выпуска": 2002,
#   "режиссер": "Сэма Рэйли",
#   "главные актеры": ["Питер Паркер", "Уиллем Дефо", "Джеймс Франко"]
# }

# print(pop(a, {})
# del a[1]
# a.remove('{}')
# print(a)







# 2. Напишите программу, которая будет запрашивать у пользователя слово и выводить его
# перевод на выбранный язык. Словарь должен содержать как минимум 5 слов и их переводы.

# num = {
#   "яблоко": "алма",
#   "мама": "апа",
#   "собака": "ит",
#   "час": "саат",
#   "привет": "салам"
# }
#
# nums = input("Введите слово: ")
# if nums in num:
#   print(num[nums])
# else:
#   print("Перевод не найден")








# 3. Создайте словарь, который будет содержать информацию о вашем любимом городе:
# название, страна, население, достопримечательности.

# strana = {
#   "название": "интернационализациялаштырылгандардансыздарбы",
#   "страна": "Кыргызстан",
#   "население": 7_370_000,
#   "достопримечательности": ["Башня Бурана", "Гора Сулайман-Тоо", "Ыссык-Кол"]
# }
# print(strana)





# 4. Напишите программу, которая будет запрашивать у пользователя
# название страны и выводить информацию о ней из созданного в предыдущей задаче словаря.

# num = input("Введите название страны: ")


# 5. Создайте словарь, который будет содержать информацию о погоде на каждый
# день недели. Ключами должны быть названия дней недели, а значениями - температуры воздуха.

# неделная_погода = {
#   "Понедельник": -2,
#   "Вторник": 4,
#   "Среда": -1,
#   "Четверг": 3,
#   "Пятница": 5,
#   "Суббота": -18,
#   "Воскресенье": -15
# }
# print(неделная_погода)



# 6. Напишите программу, которая будет запрашивать у
# пользователя день недели и выводить информацию о погоде на этот день из созданного в
# предыдущей задаче словаря.







# 7. Создайте словарь, который будет содержать информацию о количестве букв в словах.
# Ключами должны быть слова, а значениями - количество букв в них.

# num = input("")
#
# # print(num)
# с = print("каличество буквы", end=' ')
# print(len(num))
# print(с)




# 2
# z = {}
# for i in range(3):
#     a = input('Введите слово: - ')
#     b = len(a)
#     z.setdefault(a, b)
# print(z)




# 8. Напишите программу, которая будет запрашивать у пользователя слово и выводить количество букв
# в нем из созданного в предыдущей задаче словаря.

# num = input("Пишите что нибудь: - ")
#
# print(len(num))






# 9. Создайте словарь, который будет содержать информацию о количестве гласных и согласных
# букв в словах. Ключами должны быть слова, а значениями - словари с ключами
# "гласные" и "согласные" и значениями - количество соответствующих букв.









# 10. Напишите программу, которая будет запрашивать у пользователя
# слово и выводить количество гласных и согласных букв в нем из
# созданного в предыдущей задаче словаря. как сделать это в (Python ) с кодами








