# ...МЕТОДЫ ДЛЯ ФОРМАТИРОВАНИЯ:
# .strip("*") - Удаляет последовательности в строке *
# .join("*") - К каждому символу из * добавит строку
# .count("*") - Считает сколько * в строке
# .isalpha() - Определяет каждый ли символ строка
# .isdigit() - Определяет каждый ли символ цифра
# .replace("*", "") - Меняет в строке * на
#
# МЕТОДЫ СТРОК
# .startswith("*") - Найти строку начинающиеся с *
# .endswith("*") - Найти строку заканчивающиеся на *
# .format("*") - Вставить * в строку
# .split("*") - Разделить строку по *
# .center("*") - Растянуть строку по центру в * символов
# .title() - Сделать каждый первый символ заглавным
# .upper() - Сделать всю строку в БОЛЬШОМ регистре
# .lower() - Сделать всю строку в маленьком регистре