# 1. Напишите программу, которая принимает на вход кортеж строк
# и выводит на экран самую длинную строку из этого кортежа.

# a = ('Алма', 'Алмаго', 'Алма')
# print(max(a))





# 2. Напишите программу, которая принимает на вход кортеж
# чисел и выводит на экран сумму всех элементов этого кортежа.



# num = (20, 35, 40)
# print(sum(num))





# 3. Напишите программу, которая принимает на вход два кортежа
# чисел и выводит на экран среднее арифметическое значение их элементов.

# num = ("anime", "kino")
# nums = ("alma", "almurut")
# a = (sum(nums, num))
# print(a)





# 4. Напишите программу, которая принимает на вход кортеж чисел и выводит
# на экран новый кортеж, состоящий из квадратов элементов первого кортежа.





# 5. Напишите программу, которая принимает на вход кортеж
# строк и выводит на экран новый кортеж, состоящий из длин этих строк.