"""Задача Lambda"""
"""Напишите lambda-функцию, которая удваивает переданное число."""

# num = lambda x: x * 2
#
# result = num(5)
# print(result)


"""Напишите lambda-функцию, которая возвращает True,
 если число четное, и False в противном случае."""



# num = lambda x:  x % 2 == 0
# print(num(1))


"""Напишите lambda-функцию, которая принимает два 
аргумента и возвращает их сумму."""


# num = [1, 2, 3, 4, 5, 6, 7, 8, 9]
# num1 = list(filter(lambda x: x % 2 == 0, num))
# print(num1)

"""Используйте lambda-функцию для сортировки списка строк
по оследней букве каждой строки."""



"""Используйте lambda-функцию и функцию filter, чтобы 
отфильтровать только четные числа из списка."""
